Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMV71N20.xml
        <register caption="Device Endpoint Enable Register (n = 0) 0" name="USBHS_DEVEPTIER0" offset="0x1F0" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Enable" mask="0x00000001" name="TXINES"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000002" name="RXOUTES"/>
          <bitfield caption="Received SETUP Interrupt Enable" mask="0x00000004" name="RXSTPES"/>
          <bitfield caption="NAKed OUT Interrupt Enable" mask="0x00000008" name="NAKOUTES"/>
          <bitfield caption="NAKed IN Interrupt Enable" mask="0x00000010" name="NAKINES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFES"/>
          <bitfield caption="STALLed Interrupt Enable" mask="0x00000040" name="STALLEDES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETES"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBKS"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCONS"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Enable" mask="0x00010000" name="EPDISHDMAS"/>
          <bitfield caption="NYET Token Disable Enable" mask="0x00020000" name="NYETDISS"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
          <bitfield caption="STALL Request Enable" mask="0x00080000" name="STALLRQS"/>
        </register>
        <register caption="Device Endpoint Enable Register (n = 0) 1" name="USBHS_DEVEPTIER1" offset="0x1F4" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Enable" mask="0x00000001" name="TXINES"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000002" name="RXOUTES"/>
          <bitfield caption="Received SETUP Interrupt Enable" mask="0x00000004" name="RXSTPES"/>
          <bitfield caption="NAKed OUT Interrupt Enable" mask="0x00000008" name="NAKOUTES"/>
          <bitfield caption="NAKed IN Interrupt Enable" mask="0x00000010" name="NAKINES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFES"/>
          <bitfield caption="STALLed Interrupt Enable" mask="0x00000040" name="STALLEDES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETES"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBKS"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCONS"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Enable" mask="0x00010000" name="EPDISHDMAS"/>
          <bitfield caption="NYET Token Disable Enable" mask="0x00020000" name="NYETDISS"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
          <bitfield caption="STALL Request Enable" mask="0x00080000" name="STALLRQS"/>
        </register>
        <register caption="Device Endpoint Enable Register (n = 0) 2" name="USBHS_DEVEPTIER2" offset="0x1F8" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Enable" mask="0x00000001" name="TXINES"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000002" name="RXOUTES"/>
          <bitfield caption="Received SETUP Interrupt Enable" mask="0x00000004" name="RXSTPES"/>
          <bitfield caption="NAKed OUT Interrupt Enable" mask="0x00000008" name="NAKOUTES"/>
          <bitfield caption="NAKed IN Interrupt Enable" mask="0x00000010" name="NAKINES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFES"/>
          <bitfield caption="STALLed Interrupt Enable" mask="0x00000040" name="STALLEDES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETES"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBKS"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCONS"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Enable" mask="0x00010000" name="EPDISHDMAS"/>
          <bitfield caption="NYET Token Disable Enable" mask="0x00020000" name="NYETDISS"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
          <bitfield caption="STALL Request Enable" mask="0x00080000" name="STALLRQS"/>
        </register>
        <register caption="Device Endpoint Enable Register (n = 0) 3" name="USBHS_DEVEPTIER3" offset="0x1FC" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Enable" mask="0x00000001" name="TXINES"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000002" name="RXOUTES"/>
          <bitfield caption="Received SETUP Interrupt Enable" mask="0x00000004" name="RXSTPES"/>
          <bitfield caption="NAKed OUT Interrupt Enable" mask="0x00000008" name="NAKOUTES"/>
          <bitfield caption="NAKed IN Interrupt Enable" mask="0x00000010" name="NAKINES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFES"/>
          <bitfield caption="STALLed Interrupt Enable" mask="0x00000040" name="STALLEDES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETES"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBKS"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCONS"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Enable" mask="0x00010000" name="EPDISHDMAS"/>
          <bitfield caption="NYET Token Disable Enable" mask="0x00020000" name="NYETDISS"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
          <bitfield caption="STALL Request Enable" mask="0x00080000" name="STALLRQS"/>
        </register>
        <register caption="Device Endpoint Enable Register (n = 0) 4" name="USBHS_DEVEPTIER4" offset="0x200" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Enable" mask="0x00000001" name="TXINES"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000002" name="RXOUTES"/>
          <bitfield caption="Received SETUP Interrupt Enable" mask="0x00000004" name="RXSTPES"/>
          <bitfield caption="NAKed OUT Interrupt Enable" mask="0x00000008" name="NAKOUTES"/>
          <bitfield caption="NAKed IN Interrupt Enable" mask="0x00000010" name="NAKINES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFES"/>
          <bitfield caption="STALLed Interrupt Enable" mask="0x00000040" name="STALLEDES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETES"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBKS"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCONS"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Enable" mask="0x00010000" name="EPDISHDMAS"/>
          <bitfield caption="NYET Token Disable Enable" mask="0x00020000" name="NYETDISS"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
          <bitfield caption="STALL Request Enable" mask="0x00080000" name="STALLRQS"/>
        </register>
